[
  {
    "author": "Troop-the-Loop",
    "comment": "So I had a couple friends complain about Strange giving up the stone, and I've seen a few of those complaints on here and other forums. \n\nI feel like it's obvious he gave up the Time stone because he saw that is the one way they beat Thanos. I don't know if he specifically saw himself giving up the stone, or he saw Tony do something to save the day, but Strange gave up the stone to help his vision of the \"one way it works\" come to pass. \n\nIt's written all over that last interaction with Thanos and Strange and then Strange and Stark. Thanos chastizes Strange for never using the Time stone, but we clearly did see him use it. The power of the Time stone won't help in a brute-force battle, but it can help reveal the one unlikely path to victory. \n\nThen, as Strange disappears, he pointedly tells Stark that this was the only way. That there was no other way. I don't remember his exact phrase, but it really felt to me that Strange was trying to tell Stark that this is *still* part of the one way they beat Thanos. \n\nSo it isn't that Strange had a change of character, growing weak and sacrificing the universe to save a new friend. He was making the strategic play, giving up the Time stone because it plays a part in the only part to victory that he saw. \n\nJust wanted to put that out there."
  },
  {
    "author": "impulsebuyerdude",
    "comment": "Peter slowly fading away and the fear in his voice when pleading to Tony that he didn’t want to go literally broke me"
  },
  {
    "author": "[deleted]",
    "comment": "Thor's entrance back to Earth with Rocket and Groot was absolutely badass. "
  },
  {
    "author": "dragonphlegm",
    "comment": "\"You need to get lost Squidward\"\n\nThe whole theater lost it"
  },
  {
    "author": "LiteraryBoner",
    "comment": "\"I am Groot!\"\n\n\"I am Steve Rogers.\"\n\nLol no matter how hot Cap gets he's always gonna be awkward af."
  },
  {
    "author": "Naweezy",
    "comment": "Wanda had to kill Vision, then watched him getting killed by Thanos AGAIN, and then she fucking died. That was fucked up..."
  },
  {
    "author": "yn0htna",
    "comment": "RED SKULL\n\n...has been hanging out alone for quite awhile"
  },
  {
    "author": "benjwilliams98",
    "comment": "Marvel Writers:*\"Bucky Barnes picked up Rocket and they start doing a 360 shooting everywhere\"*  \n  \nFans: More Please...  "
  },
  {
    "author": "benjwilliams98",
    "comment": "“You’re from Earth” “No I’m from Missouri” “That’s on Earth dipshit”"
  },
  {
    "author": "-HeisenBird-",
    "comment": "\"WhY Can'T HuLK juSt BeaT Up ThANoS?\"\n\n*opening scene*\n\n\"Well, fuck\""
  },
  {
    "author": "benjwilliams98",
    "comment": "\"Thanos will Return\"\n\nTalk about the biggest middle finger in the world"
  },
  {
    "author": "[deleted]",
    "comment": "[deleted]"
  },
  {
    "author": "WirelessSurvivor",
    "comment": "I'm the one black guy in our friend group, when Black Panther disappeared they all looked at me like I just lost a part of my life."
  },
  {
    "author": "Disco_Tardis",
    "comment": "NO DON'T PUT YOUR EGGS IN ME."
  },
  {
    "author": "benjwilliams98",
    "comment": "Thor has become my favourite MCU character, after that landing in Wakanda, I knew that shit was about to get real."
  },
  {
    "author": "benjwilliams98",
    "comment": "The founding members of The Avengers are still alive, makes me think back to Tony Stark’s line:  \n*If we can’t protect the Earth, you can be damn sure we’ll Avenge it*  \nAvengers 4 here we go.\n"
  },
  {
    "author": "Nessfull",
    "comment": "Dinklegiant was a great surprise\n"
  },
  {
    "author": "Woollen",
    "comment": "WHERE IS GAMORA?\nWHO IS GAMORA?\n… WHY IS GAMORA??\n\nhahaha, this line was great. Drax had some quality scenes this movie!"
  },
  {
    "author": "DarkSoldat",
    "comment": "I laughed WAY too hard when Drax had that insanely huge gun pointed right at this face and he goes “Go on Quill! I can take it....”"
  },
  {
    "author": "_HaasGaming",
    "comment": "You know a movie can't be bad when \"He threw an actual moon at them\" isn't even in the top 5 discussed moments. "
  },
  {
    "author": "marklovesbb",
    "comment": "Fuck it, spider man’s death got me hard. Tom Holland can act. Love that kid. "
  },
  {
    "author": "SomeGuyWhoLikesABook",
    "comment": "Thanos got his sunset. This was his movie."
  },
  {
    "author": "[deleted]",
    "comment": "[deleted]"
  },
  {
    "author": "ConsolationPrzFightr",
    "comment": "They got a dwarf to play a dwarf that lives on a dwarf star and he dwarfs everyone else"
  },
  {
    "author": "bydemons",
    "comment": "\"Yeah, imma get that arm...\""
  },
  {
    "author": "Woollen",
    "comment": "Love how they specified Dr. Strange saw 14 million futures and only one where they won. \n\nSo he must have let everything up until now (Peter punching Thanos, saving Iron Man, giving up the stone) happen in accordance with the one future where they win. \n\nHe’s gone now though so everything is left to chance (minus it being a movie and all and that one possibility happening)"
  },
  {
    "author": "Woollen",
    "comment": "Thanos sure loves his bubbles!"
  },
  {
    "author": "dannyswrld",
    "comment": "I’m amazed they managed to prolong Vision’s death for two and a half hours. But they made up for it by killing him *twice*\n\n\nEdit: hijacking this just to say, I updated the site one last time. It's been a pleasure shitposting with you guys.\n\nhttp://isvisiondeadyet.com/"
  },
  {
    "author": "loyal_achades",
    "comment": "\"Thank you, rabbit.\"\n\nMan this new Thor is fucking great. Shocked he didn't die, though..."
  },
  {
    "author": "LevitateGx",
    "comment": "I love how Banner said to the Black Order and the Outriders \"you guys are screwed now\" when Thor arrived in Wakanda. Usually everyone says that about the Hulk when he shows up. Thor really is the strongest Avenger."
  },
  {
    "author": "Coinshot_Kvothe",
    "comment": "Dr Strange vs Thanos is the best live action naruto fight we are ever going to get in a movie"
  },
  {
    "author": "louisbancroft",
    "comment": "I demand for the other 14,000,604 different versions of the final battle."
  },
  {
    "author": "[deleted]",
    "comment": "Rocket: “I have a lot to lose.”\nRocket: loses everything "
  },
  {
    "author": "MythSlayer01",
    "comment": "That SOS page to Captain Marvel was def to the 90s..."
  },
  {
    "author": "[deleted]",
    "comment": "\"I told you, you'd die for that\"\n\nThor is so badass."
  },
  {
    "author": "sexygaypalpatine",
    "comment": "The Guardians in awe over Thor’s beauty was relatable. Sexy Pirate Angel hybrid."
  },
  {
    "author": "KA1N3R",
    "comment": "My theatre was dead fucking quiet from the moment Thanos snapped until the credits began, at which point a few people loudly said 'what the fuck' and then it got quiet again.\n\nThe two things I liked most about the movie:  \nFor the first time, Marvel felt dark and grim and I loved that. It's the Empire Strikes Back of superhero movies, only even less hopeful.  \nAlso, this is, for me anyway, the first time we see some _real_ **super**powers. Be it Strange's amazing magic, powered up Thor, Iron-SwissArmyKnife-Man or the multiple different powers of the infinity stones.\n\n\nAlso, Starlord is a fuckwad."
  },
  {
    "author": "666lucifer",
    "comment": "One day I want to be as stoned as the guy who suggested that Peter Dinklage played a 25 foot tall dwarf "
  },
  {
    "author": "thebreak22",
    "comment": "I love the absence of music in those last moments. They finally employed the less is more mindset after 2.5 hrs of nonstop action, and it's gloriously bleak."
  },
  {
    "author": "DrewZee-DC",
    "comment": "Rocket is the last Guardian standing :( and this is the second time he's had to watch Groot die. \n\nI feel for the little rabbit."
  }
]